# Конфигурация бота

# Токен бота (получите от @BotFather)
BOT_TOKEN = "7745960042:AAEH6kaw957hBG-UKqgHUf_KCdi1anTV-Fw"

# ID администраторов, которые будут получать анкеты
# Чтобы узнать свой ID, напишите боту @userinfobot
# Можно указать одного или нескольких админов
ADMIN_IDS = [
    7816658656,  # Замените на ваш Telegram ID
    8003560030,  # Раскомментируйте и добавьте ID второго админа
    5537039518,  # Можно добавить сколько угодно
]


# ID канала/группы для публикации принятых анкет (необязательно)
# Формат: @channel_username или -100123456789
# Чтобы узнать ID канала/группы:
# 1. Добавьте бота в канал/группу как администратора с правом публикации
# 2. Перешлите любое сообщение из канала/группы боту @userinfobot
# Оставьте None если не нужно публиковать
CHANNEL_ID = -1003564273305  # Например: "@my_channel" или -1001234567890

